-- MySQL dump 10.13  Distrib 8.0.29, for Win64 (x86_64)
--
-- Host: localhost    Database: airport
-- ------------------------------------------------------
-- Server version	8.0.29

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `airplane`
--

DROP TABLE IF EXISTS `airplane`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `airplane` (
  `id` int NOT NULL,
  `тип самолета` varchar(45) DEFAULT NULL,
  `число мест` int DEFAULT NULL,
  `число свободных мест` int DEFAULT NULL,
  `дата вылета` varchar(45) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `airplane`
--

LOCK TABLES `airplane` WRITE;
/*!40000 ALTER TABLE `airplane` DISABLE KEYS */;
INSERT INTO `airplane` VALUES (1,'Пассажирский',170,50,'2021-01-20'),(2,'Грузовой',0,0,'2020-03-31'),(3,'Пассажирский',110,23,'2020-02-26'),(4,'Грузовой',0,0,'2022-05-12'),(5,'Грузовой',0,0,'2021-02-02'),(6,'Грузовой',0,0,'2022-03-13'),(7,'Военный',30,10,'2020-06-08'),(8,'Пассажирский',200,100,'2020-12-17'),(9,'Военный',0,0,'2021-11-07'),(10,'Пассажирский',130,0,'2022-01-29');
/*!40000 ALTER TABLE `airplane` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `place`
--

DROP TABLE IF EXISTS `place`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `place` (
  `id` int NOT NULL,
  `пункт назначения` varchar(45) DEFAULT NULL,
  `время вылета` varchar(45) DEFAULT NULL,
  `время в полете` varchar(45) DEFAULT NULL,
  `время прибытия` varchar(45) DEFAULT NULL,
  `цена билета` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `place`
--

LOCK TABLES `place` WRITE;
/*!40000 ALTER TABLE `place` DISABLE KEYS */;
INSERT INTO `place` VALUES (2,'Москва','12:00','7:00','19:00',15000),(3,'Москва','18:00','4:00','22:00',30000),(2,'Москва','16:00','19:00','11:00',2000),(4,'Москва','12:00','14:00','02:00',33000),(6,'Киев','12:00','15:30','03:30',35000),(5,'Киев','10:30','16:00','02:30',30200),(7,'Киев','17:00','3:00','20:00',40000),(8,'Киев','12:00','15:00','03:00',400),(8,'Москва','12:00','8:00','20:00',50000),(8,'Москва','12:00','4:00','16:00',6000),(8,'Москва','08:00','6:00','14:00',8500),(9,'Москва','11:30','2:30','02:00',42000),(10,'Минск','18:00','8:00','02:00',63000),(10,'Лондон','04:00','15:00','19:00',9600),(1,'Лондон','06:30','3:30','10:00',5000),(2,'Лондон','12:30','15:00','03:30',40000),(3,'Лондон','19:00','10:00','05:00',8000),(5,'Лондон','10:00','10:00','20:00',600),(6,'Нью-Йорк','12:00','15:00','20:00',500),(5,'Нью-Йорк','08:20','4:40','13:00',4300),(5,'Нью-Йорк','15:00','15:00','06:00',8000),(5,'Нью-Йорк','12:00','19:00','11:00',9000),(6,'Нью-Йорк','10:00','5:00','15:00',4000),(7,'Москва','01:00','3:00','04:00',50000),(7,'Москва','07:30','3:30','11:00',7000),(3,'Москва','11:00','10:00','21:00',2000),(1,'Минск','12:00','15:45','03:45',1000),(2,'Москва','12:00','7:00','19:00',15000),(3,'Москва','18:00','4:00','22:00',30000),(2,'Москва','16:00','19:00','11:00',2000),(4,'Москва','12:00','14:00','02:00',33000),(6,'Киев','12:00','15:30','03:30',35000),(5,'Киев','10:30','16:00','02:30',30200),(7,'Киев','17:00','3:00','20:00',40000),(8,'Киев','12:00','15:00','03:00',400),(8,'Москва','12:00','8:00','20:00',50000),(8,'Москва','12:00','4:00','16:00',6000),(8,'Москва','08:00','6:00','14:00',8500),(9,'Москва','11:30','2:30','02:00',42000),(10,'Минск','18:00','8:00','02:00',63000),(10,'Лондон','04:00','15:00','19:00',9600),(1,'Лондон','06:30','3:30','10:00',5000),(2,'Лондон','12:30','15:00','03:30',40000),(3,'Лондон','19:00','10:00','05:00',8000),(5,'Лондон','10:00','10:00','20:00',600),(6,'Нью-Йорк','12:00','15:00','20:00',500),(5,'Нью-Йорк','08:20','4:40','13:00',4300),(5,'Нью-Йорк','15:00','15:00','06:00',8000),(5,'Нью-Йорк','12:00','19:00','11:00',9000),(6,'Нью-Йорк','10:00','5:00','15:00',4000),(7,'Москва','01:00','3:00','04:00',50000),(7,'Москва','07:30','3:30','11:00',7000),(3,'Москва','11:00','10:00','21:00',2000),(1,'Минск','12:00','15:45','03:45',1000),(2,'Москва','16:00','11:00','19:00',2000),(4,'Москва','12:00','02:00','14:00',33000);
/*!40000 ALTER TABLE `place` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-06-29 20:16:47
